<template>
	<div>
		<UAccordion :items="items" />
	</div>
</template>

<script setup lang="ts">
definePageMeta({
	layout: 'default',
})

const items = [
	{
		label: 'Как зарегистрироваться на нашей социальной сети?',
		icon: 'i-heroicons-user-plus',
		defaultOpen: true,
		content:
			'Чтобы зарегистрироваться, нажмите кнопку "Зарегистрироваться" на главной странице и заполните форму регистрации.',
	},
	{
		label: 'Как добавить друга?',
		icon: 'i-heroicons-user-add',
		content:
			'Чтобы добавить друга, перейдите на его профиль и нажмите кнопку "Добавить в друзья".',
	},
	{
		label: 'Как удалить свой аккаунт?',
		icon: 'i-heroicons-trash',
		content:
			'Чтобы удалить свой аккаунт, перейдите в настройки профиля и выберите пункт "Удалить аккаунт".',
	},
	{
		label: 'Как создать группу?',
		icon: 'i-heroicons-users',
		content:
			'Чтобы создать группу, нажмите кнопку "Создать группу" на главной странице и заполните форму создания группы.',
	},
	{
		label: 'Как изменить свою фотографию профиля?',
		icon: 'i-heroicons-camera',
		content:
			'Чтобы изменить фотографию профиля, перейдите в настройки профиля и нажмите на вашу текущую фотографию профиля, затем выберите новое изображение.',
	},
	{
		label: 'Как связаться с поддержкой?',
		icon: 'i-heroicons-headphones',
		content:
			'Чтобы связаться с поддержкой, напишите нам на электронную почту support@mysocialnetwork.com или воспользуйтесь формой обратной связи на нашем сайте.',
	},
]
</script>
